ZzzzzzS/Nxp-Smart-Car-13/board/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
HIDPinsInit:
- options: {callFromInitBoot: 'true', prefix: HIDPINSINIT_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '140', peripheral: SPI2, signal: PCS0_SS, pin_signal: PTD11/LLWU_P25/SPI2_PCS0/UART5_CTS_b/FLEXPWM0_B2/FB_A19}
  - {pin_num: '144', peripheral: SPI2, signal: PCS1, pin_signal: PTD15/SPI2_PCS1/FLEXPWM0_B0/FB_A23}
  - {pin_num: '141', peripheral: SPI2, signal: SCK, pin_signal: PTD12/SPI2_SCK/FTM3_FLT0/XB_IN5/XB_OUT5/FLEXPWM0_A1/FB_A20}
  - {pin_num: '143', peripheral: SPI2, signal: SIN, pin_signal: PTD14/SPI2_SIN/XB_IN11/XB_OUT11/FLEXPWM0_A0/FB_A22}
  - {pin_num: '142', peripheral: SPI2, signal: SOUT, pin_signal: PTD13/SPI2_SOUT/XB_IN7/XB_OUT7/FLEXPWM0_B1/FB_A21}
  - {pin_num: '120', peripheral: GPIOC, signal: 'GPIO, 15', pin_signal: PTC15/I2C1_SDA/I2C0_SDA/FLEXPWM1_B0/FB_AD24/UART4_TX}
  - {pin_num: '123', peripheral: GPIOC, signal: 'GPIO, 16', pin_signal: PTC16/CAN1_RX/UART3_RX/ENET0_1588_TMR0/FLEXPWM1_A2/FB_CS5_b/FB_TSIZ1/FB_BE23_16_b}
  - {pin_num: '124', peripheral: GPIOC, signal: 'GPIO, 17', pin_signal: PTC17/CAN1_TX/UART3_TX/ENET0_1588_TMR1/FLEXPWM1_B2/FB_CS4_b/FB_TSIZ0/FB_BE31_24_b}
  - {pin_num: '125', peripheral: GPIOC, signal: 'GPIO, 18', pin_signal: PTC18/UART3_RTS_b/ENET0_1588_TMR2/FLEXPWM1_A3/FB_TBST_b/FB_CS2_b/FB_BE15_8_b}
  - {pin_num: '126', peripheral: GPIOC, signal: 'GPIO, 19', pin_signal: PTC19/UART3_CTS_b/ENET0_1588_TMR3/FLEXPWM1_B3/FB_CS3_b/FB_BE7_0_b/FB_TA_b}
  - {pin_num: '80', peripheral: GPIOA, signal: 'GPIO, 29', pin_signal: PTA29/MII0_COL/FB_A24}
  - {pin_num: '79', peripheral: GPIOA, signal: 'GPIO, 28', pin_signal: PTA28/MII0_TXER/FB_A25}
  - {pin_num: '78', peripheral: GPIOA, signal: 'GPIO, 27', pin_signal: PTA27/MII0_CRS/FB_A26}
  - {pin_num: '77', peripheral: GPIOA, signal: 'GPIO, 26', pin_signal: PTA26/MII0_TXD3/FB_A27}
  - {pin_num: '76', peripheral: GPIOA, signal: 'GPIO, 25', pin_signal: PTA25/XB_IN5/MII0_TXCLK/FB_A28}
  - {pin_num: '75', peripheral: GPIOA, signal: 'GPIO, 24', pin_signal: PTA24/XB_IN4/MII0_TXD2/FB_A29}
  - {pin_num: '73', peripheral: GPIOA, signal: 'GPIO, 19', pin_signal: XTAL0/PTA19/XB_IN8/FTM1_FLT0/FTM_CLKIN1/XB_OUT9/LPTMR0_ALT1}
  - {pin_num: '72', peripheral: GPIOA, signal: 'GPIO, 18', pin_signal: EXTAL0/PTA18/XB_IN7/FTM0_FLT2/FTM_CLKIN0/XB_OUT8/FTM3_CH2}
  - {pin_num: '139', peripheral: GPIOD, signal: 'GPIO, 10', pin_signal: PTD10/UART5_RTS_b/FLEXPWM0_A2/FB_A18}
  - {pin_num: '118', peripheral: GPIOC, signal: 'GPIO, 13', pin_signal: PTC13/CAN2_RX/FTM_CLKIN1/FLEXPWM1_B1/FB_AD26/UART4_CTS_b}
  - {pin_num: '117', peripheral: GPIOC, signal: 'GPIO, 12', pin_signal: PTC12/CAN2_TX/FTM_CLKIN0/FLEXPWM1_A1/FTM3_FLT0/SPI2_PCS1/FB_AD27/UART4_RTS_b}
  - {pin_num: '11', peripheral: FTM3, signal: 'CH, 3', pin_signal: PTE8/UART5_TX/FLEXPWM1_B1/FTM3_CH3, direction: OUTPUT}
  - {pin_num: '12', peripheral: FTM3, signal: 'CH, 4', pin_signal: PTE9/LLWU_P17/UART5_RX/FLEXPWM1_A2/FTM3_CH4, direction: OUTPUT}
  - {pin_num: '13', peripheral: FTM3, signal: 'CH, 5', pin_signal: PTE10/LLWU_P18/UART5_CTS_b/FLEXPWM1_B2/FTM3_CH5, direction: OUTPUT}
  - {pin_num: '116', peripheral: GPIOC, signal: 'GPIO, 11', pin_signal: HSADC1B_CH14/PTC11/LLWU_P11/I2C1_SDA/FTM3_CH7/FLEXPWM1_B3/FB_RW_b}
  - {pin_num: '115', peripheral: GPIOC, signal: 'GPIO, 10', pin_signal: HSADC1B_CH13/PTC10/I2C1_SCL/FTM3_CH6/FLEXPWM1_A3/FB_AD5}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/*FUNCTION**********************************************************************
 *
 * Function Name : HIDPinsInit
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 *END**************************************************************************/
void HIDPinsInit(void) {
  CLOCK_EnableClock(kCLOCK_PortA);                           /* Port A Clock Gate Control: Clock enabled */
  CLOCK_EnableClock(kCLOCK_PortC);                           /* Port C Clock Gate Control: Clock enabled */
  CLOCK_EnableClock(kCLOCK_PortD);                           /* Port D Clock Gate Control: Clock enabled */
  CLOCK_EnableClock(kCLOCK_PortE);                           /* Port E Clock Gate Control: Clock enabled */

  PORT_SetPinMux(PORTA, PIN18_IDX, kPORT_MuxAsGpio);         /* PORTA18 (pin 72) is configured as PTA18 */
  PORT_SetPinMux(PORTA, PIN19_IDX, kPORT_MuxAsGpio);         /* PORTA19 (pin 73) is configured as PTA19 */
  PORT_SetPinMux(PORTA, PIN24_IDX, kPORT_MuxAsGpio);         /* PORTA24 (pin 75) is configured as PTA24 */
  PORT_SetPinMux(PORTA, PIN25_IDX, kPORT_MuxAsGpio);         /* PORTA25 (pin 76) is configured as PTA25 */
  PORT_SetPinMux(PORTA, PIN26_IDX, kPORT_MuxAsGpio);         /* PORTA26 (pin 77) is configured as PTA26 */
  PORT_SetPinMux(PORTA, PIN27_IDX, kPORT_MuxAsGpio);         /* PORTA27 (pin 78) is configured as PTA27 */
  PORT_SetPinMux(PORTA, PIN28_IDX, kPORT_MuxAsGpio);         /* PORTA28 (pin 79) is configured as PTA28 */
  PORT_SetPinMux(PORTA, PIN29_IDX, kPORT_MuxAsGpio);         /* PORTA29 (pin 80) is configured as PTA29 */
  PORT_SetPinMux(PORTC, PIN10_IDX, kPORT_MuxAsGpio);         /* PORTC10 (pin 115) is configured as PTC10 */
  PORT_SetPinMux(PORTC, PIN11_IDX, kPORT_MuxAsGpio);         /* PORTC11 (pin 116) is configured as PTC11 */
  PORT_SetPinMux(PORTC, PIN12_IDX, kPORT_MuxAsGpio);         /* PORTC12 (pin 117) is configured as PTC12 */
  PORT_SetPinMux(PORTC, PIN13_IDX, kPORT_MuxAsGpio);         /* PORTC13 (pin 118) is configured as PTC13 */
  PORT_SetPinMux(PORTC, PIN15_IDX, kPORT_MuxAsGpio);         /* PORTC15 (pin 120) is configured as PTC15 */
  PORT_SetPinMux(PORTC, PIN16_IDX, kPORT_MuxAsGpio);         /* PORTC16 (pin 123) is configured as PTC16 */
  PORT_SetPinMux(PORTC, PIN17_IDX, kPORT_MuxAsGpio);         /* PORTC17 (pin 124) is configured as PTC17 */
  PORT_SetPinMux(PORTC, PIN18_IDX, kPORT_MuxAsGpio);         /* PORTC18 (pin 125) is configured as PTC18 */
  PORT_SetPinMux(PORTC, PIN19_IDX, kPORT_MuxAsGpio);         /* PORTC19 (pin 126) is configured as PTC19 */
  PORT_SetPinMux(PORTD, PIN10_IDX, kPORT_MuxAsGpio);         /* PORTD10 (pin 139) is configured as PTD10 */
  PORT_SetPinMux(PORTD, PIN11_IDX, kPORT_MuxAlt2);           /* PORTD11 (pin 140) is configured as SPI2_PCS0 */
  PORT_SetPinMux(PORTD, PIN12_IDX, kPORT_MuxAlt2);           /* PORTD12 (pin 141) is configured as SPI2_SCK */
  PORT_SetPinMux(PORTD, PIN13_IDX, kPORT_MuxAlt2);           /* PORTD13 (pin 142) is configured as SPI2_SOUT */
  PORT_SetPinMux(PORTD, PIN14_IDX, kPORT_MuxAlt2);           /* PORTD14 (pin 143) is configured as SPI2_SIN */
  PORT_SetPinMux(PORTD, PIN15_IDX, kPORT_MuxAlt2);           /* PORTD15 (pin 144) is configured as SPI2_PCS1 */
  PORT_SetPinMux(PORTE, PIN10_IDX, kPORT_MuxAlt6);           /* PORTE10 (pin 13) is configured as FTM3_CH5 */
  PORT_SetPinMux(PORTE, PIN8_IDX, kPORT_MuxAlt6);            /* PORTE8 (pin 11) is configured as FTM3_CH3 */
  PORT_SetPinMux(PORTE, PIN9_IDX, kPORT_MuxAlt6);            /* PORTE9 (pin 12) is configured as FTM3_CH4 */
  SIM->SOPT8 = ((SIM->SOPT8 &
    (~(SIM_SOPT8_FTM3OCH3SRC_MASK | SIM_SOPT8_FTM3OCH4SRC_MASK | SIM_SOPT8_FTM3OCH5SRC_MASK))) /* Mask bits to zero which are setting */
      | SIM_SOPT8_FTM3OCH3SRC(SOPT8_FTM3OCH3SRC_FTM)         /* FTM3 channel 3 output source: FTM3_CH3 pin is output of FTM3 channel 3 output */
      | SIM_SOPT8_FTM3OCH4SRC(SOPT8_FTM3OCH4SRC_FTM)         /* FTM3 channel 4 output source: FTM3_CH4 pin is output of FTM3 channel 4 output */
      | SIM_SOPT8_FTM3OCH5SRC(SOPT8_FTM3OCH5SRC_FTM)         /* FTM3 channel 5 output source: FTM3_CH5 pin is output of FTM3 channel 5 output */
    );
}


#define PIN0_IDX                         0u   /*!< Pin number for pin 0 in a port */
#define PIN1_IDX                         1u   /*!< Pin number for pin 1 in a port */
#define PIN2_IDX                         2u   /*!< Pin number for pin 2 in a port */
#define PIN3_IDX                         3u   /*!< Pin number for pin 3 in a port */
#define PIN4_IDX                         4u   /*!< Pin number for pin 4 in a port */
#define PIN5_IDX                         5u   /*!< Pin number for pin 5 in a port */
#define PIN6_IDX                         6u   /*!< Pin number for pin 6 in a port */
#define PIN7_IDX                         7u   /*!< Pin number for pin 7 in a port */

#define PIN8_IDX                         8u   /*!< Pin number for pin 8 in a port */

