ZzzzzzS/Nxp-Smart-Car-13/board/pin_mux.c
#define PIN9_IDX                         9u   /*!< Pin number for pin 9 in a port */

#define PIN18_IDX                       18u   /*!< Pin number for pin 18 in a port */

#define PIN19_IDX                       19u   /*!< Pin number for pin 19 in a port */

#define PIN26_IDX                       26u   /*!< Pin number for pin 26 in a port */

#define PIN27_IDX                       27u   /*!< Pin number for pin 27 in a port */

#define PIN28_IDX                       28u   /*!< Pin number for pin 28 in a port */

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
CamraPinsInit:
- options: {callFromInitBoot: 'true', prefix: CAMRAPINSINIT_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '21', peripheral: I2C0, signal: SCL, pin_signal: HSADC0B_CH1/ADC0_SE6a/PTE19/SPI0_SIN/UART2_RTS_b/I2C0_SCL/CMP3_OUT, pull_select: no_init}
  - {pin_num: '20', peripheral: I2C0, signal: SDA, pin_signal: HSADC0B_CH0/ADC0_SE5a/PTE18/LLWU_P20/SPI0_SOUT/UART2_CTS_b/I2C0_SDA, pull_select: no_init}
  - {pin_num: '47', peripheral: GPIOE, signal: 'GPIO, 26', pin_signal: PTE26/ENET_1588_CLKIN/FTM0_CH4/UART4_CTS_b, direction: INPUT}
  - {pin_num: '48', peripheral: GPIOE, signal: 'GPIO, 27', pin_signal: PTE27/CAN2_TX/UART4_RTS_b, direction: INPUT}
  - {pin_num: '49', peripheral: GPIOE, signal: 'GPIO, 28', pin_signal: PTE28/CAN2_RX, direction: INPUT}
  - {pin_num: '81', peripheral: GPIOB, signal: 'GPIO, 0', pin_signal: HSADC0B_CH2/PTB0/LLWU_P5/I2C0_SCL/FTM1_CH0/FTM1_QD_PHA/UART0_RX/RMII0_MDIO/MII0_MDIO, direction: INPUT}
  - {pin_num: '82', peripheral: GPIOB, signal: 'GPIO, 1', pin_signal: HSADC0B_CH3/PTB1/I2C0_SDA/FTM1_CH1/FTM0_FLT2/EWM_IN/FTM1_QD_PHB/UART0_TX/RMII0_MDC/MII0_MDC,
    direction: INPUT}
  - {pin_num: '83', peripheral: GPIOB, signal: 'GPIO, 2', pin_signal: HSADC0A_CH14/CMP2_IN2/PTB2/I2C0_SCL/UART0_RTS_b/FTM0_FLT1/ENET0_1588_TMR0/FTM0_FLT3, direction: INPUT}
  - {pin_num: '84', peripheral: GPIOB, signal: 'GPIO, 3', pin_signal: HSADC0B_CH15/CMP3_IN5/PTB3/I2C0_SDA/UART0_CTS_b/UART0_COL_b/ENET0_1588_TMR1/FTM0_FLT0, direction: INPUT}
  - {pin_num: '85', peripheral: GPIOB, signal: 'GPIO, 4', pin_signal: ADC0_SE6b/PTB4/FLEXPWM1_X0/ENET0_1588_TMR2/FTM1_FLT0, direction: INPUT}
  - {pin_num: '86', peripheral: GPIOB, signal: 'GPIO, 5', pin_signal: ADC0_SE7b/PTB5/FLEXPWM1_X1/ENET0_1588_TMR3/FTM2_FLT0, direction: INPUT}
  - {pin_num: '87', peripheral: GPIOB, signal: 'GPIO, 6', pin_signal: HSADC1A_CH12/PTB6/CAN2_TX/FLEXPWM1_X2/FB_AD23, direction: INPUT}
  - {pin_num: '88', peripheral: GPIOB, signal: 'GPIO, 7', pin_signal: HSADC1A_CH13/PTB7/CAN2_RX/FLEXPWM1_X3/FB_AD22, direction: INPUT}
  - {pin_num: '89', peripheral: GPIOB, signal: 'GPIO, 8', pin_signal: PTB8/UART3_RTS_b/FB_AD21, direction: INPUT}
  - {pin_num: '90', peripheral: GPIOB, signal: 'GPIO, 9', pin_signal: PTB9/SPI1_PCS1/UART3_CTS_b/ENET0_1588_TMR2/FB_AD20, direction: INPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/*FUNCTION**********************************************************************
 *
 * Function Name : CamraPinsInit
 * Description   : 
 *
 *END**************************************************************************/
void CamraPinsInit(void) {
  CLOCK_EnableClock(kCLOCK_PortB);                           /* Port B Clock Gate Control: Clock enabled */
  CLOCK_EnableClock(kCLOCK_PortE);                           /* Port E Clock Gate Control: Clock enabled */

  PORT_SetPinMux(PORTB, PIN0_IDX, kPORT_MuxAsGpio);          /* PORTB0 (pin 81) is configured as PTB0 */
  PORT_SetPinMux(PORTB, PIN1_IDX, kPORT_MuxAsGpio);          /* PORTB1 (pin 82) is configured as PTB1 */
  PORT_SetPinMux(PORTB, PIN2_IDX, kPORT_MuxAsGpio);          /* PORTB2 (pin 83) is configured as PTB2 */
  PORT_SetPinMux(PORTB, PIN3_IDX, kPORT_MuxAsGpio);          /* PORTB3 (pin 84) is configured as PTB3 */
  PORT_SetPinMux(PORTB, PIN4_IDX, kPORT_MuxAsGpio);          /* PORTB4 (pin 85) is configured as PTB4 */
  PORT_SetPinMux(PORTB, PIN5_IDX, kPORT_MuxAsGpio);          /* PORTB5 (pin 86) is configured as PTB5 */
  PORT_SetPinMux(PORTB, PIN6_IDX, kPORT_MuxAsGpio);          /* PORTB6 (pin 87) is configured as PTB6 */
  PORT_SetPinMux(PORTB, PIN7_IDX, kPORT_MuxAsGpio);          /* PORTB7 (pin 88) is configured as PTB7 */
  PORT_SetPinMux(PORTB, PIN8_IDX, kPORT_MuxAsGpio);          /* PORTB8 (pin 89) is configured as PTB8 */
  PORT_SetPinMux(PORTB, PIN9_IDX, kPORT_MuxAsGpio);          /* PORTB9 (pin 90) is configured as PTB9 */
  PORT_SetPinMux(PORTE, PIN18_IDX, kPORT_MuxAlt4);           /* PORTE18 (pin 20) is configured as I2C0_SDA */
  PORT_SetPinMux(PORTE, PIN19_IDX, kPORT_MuxAlt4);           /* PORTE19 (pin 21) is configured as I2C0_SCL */
  PORT_SetPinMux(PORTE, PIN26_IDX, kPORT_MuxAsGpio);         /* PORTE26 (pin 47) is configured as PTE26 */
  PORT_SetPinMux(PORTE, PIN27_IDX, kPORT_MuxAsGpio);         /* PORTE27 (pin 48) is configured as PTE27 */
  PORT_SetPinMux(PORTE, PIN28_IDX, kPORT_MuxAsGpio);         /* PORTE28 (pin 49) is configured as PTE28 */
}



#define PIN1_IDX                         1u   /*!< Pin number for pin 1 in a port */

#define PIN2_IDX                         2u   /*!< Pin number for pin 2 in a port */

#define PIN3_IDX                         3u   /*!< Pin number for pin 3 in a port */

#define PIN4_IDX                         4u   /*!< Pin number for pin 4 in a port */

#define PIN8_IDX                         8u   /*!< Pin number for pin 8 in a port */

#define PIN9_IDX                         9u   /*!< Pin number for pin 9 in a port */

#define PIN10_IDX                       10u   /*!< Pin number for pin 10 in a port */

#define PIN11_IDX                       11u   /*!< Pin number for pin 11 in a port */

#define PIN12_IDX                       12u   /*!< Pin number for pin 12 in a port */

#define PIN13_IDX                       13u   /*!< Pin number for pin 13 in a port */

#define PIN18_IDX                       18u   /*!< Pin number for pin 18 in a port */
#define SOPT8_FTM0OCH0SRC_FTM         0x00u   /*!< FTM0 channel 0 output source: FTM0_CH0 pin is output of FTM0 channel 0 output */
#define SOPT8_FTM0OCH1SRC_FTM         0x00u   /*!< FTM0 channel 1 output source: FTM0_CH1 pin is output of FTM0 channel 1 output */
#define SOPT8_FTM0OCH2SRC_FTM         0x00u   /*!< FTM0 channel 2 output source: FTM0_CH2 pin is output of FTM0 channel 2 output */
#define SOPT8_FTM0OCH3SRC_FTM         0x00u   /*!< FTM0 channel 3 output source: FTM0_CH3 pin is output of FTM0 channel 3 output */
#define SOPT8_FTM3OCH2SRC_FTM         0x00u   /*!< FTM3 channel 2 output source: FTM3_CH2 pin is output of FTM3 channel 2 output */

