ZzzzzzS/Nxp-Smart-Car-13/board/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
MotorPinsInit:
- options: {callFromInitBoot: 'true', prefix: MOTORPINSINIT_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '64', peripheral: FTM1, signal: 'QD_PH, A', pin_signal: CMP2_IN0/PTA12/CAN0_TX/FTM1_CH0/RMII0_RXD1/MII0_RXD1/FTM1_QD_PHA/I2C0_SCL}
  - {pin_num: '65', peripheral: FTM1, signal: 'QD_PH, B', pin_signal: CMP2_IN1/PTA13/LLWU_P4/CAN0_RX/FTM1_CH1/RMII0_RXD0/MII0_RXD0/FTM1_QD_PHB/I2C1_SDA}
  - {pin_num: '62', peripheral: FTM2, signal: 'QD_PH, A', pin_signal: PTA10/LLWU_P22/FTM2_CH0/MII0_RXD2/FTM2_QD_PHA/TRACE_D0}
  - {pin_num: '63', peripheral: FTM2, signal: 'QD_PH, B', pin_signal: PTA11/LLWU_P23/FTM2_CH1/MII0_RXCLK/FTM2_QD_PHB/I2C0_SDA}
  - {pin_num: '104', peripheral: FTM0, signal: 'CH, 0', pin_signal: HSADC0B_CH9/PTC1/LLWU_P6/SPI0_PCS3/UART1_RTS_b/FTM0_CH0/FLEXPWM0_A3/XB_IN11/FB_AD13, direction: OUTPUT}
  - {pin_num: '105', peripheral: FTM0, signal: 'CH, 1', pin_signal: HSADC1B_CH10/CMP1_IN0/PTC2/SPI0_PCS2/UART1_CTS_b/FTM0_CH1/FLEXPWM0_B3/XB_IN6/FB_AD12, direction: OUTPUT}
  - {pin_num: '106', peripheral: FTM0, signal: 'CH, 2', pin_signal: CMP1_IN1/PTC3/LLWU_P7/SPI0_PCS1/UART1_RX/FTM0_CH2/CLKOUT/FTM3_FLT0, direction: OUTPUT}
  - {pin_num: '109', peripheral: FTM0, signal: 'CH, 3', pin_signal: PTC4/LLWU_P8/SPI0_PCS0/UART1_TX/FTM0_CH3/CMP1_OUT/FB_AD11, direction: OUTPUT}
  - {pin_num: '97', peripheral: FTM3, signal: 'CH, 2', pin_signal: PTB18/CAN0_TX/FTM2_CH0/FTM3_CH2/FLEXPWM1_A1/FTM2_QD_PHA/FB_AD15, direction: OUTPUT}
  - {pin_num: '113', peripheral: HSADC1, signal: 'ADCB, CH11', pin_signal: HSADC1B_CH11/CMP0_IN2/PTC8/FTM3_CH4/FLEXPWM1_A2/FB_AD7}
  - {pin_num: '114', peripheral: HSADC1, signal: 'ADCB, CH12', pin_signal: HSADC1B_CH12/CMP0_IN3/PTC9/FTM3_CH5/FLEXPWM1_B2/FB_AD6}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/*FUNCTION**********************************************************************
 *
 * Function Name : MotorPinsInit
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 *END**************************************************************************/
void MotorPinsInit(void) {
  CLOCK_EnableClock(kCLOCK_PortA);                           /* Port A Clock Gate Control: Clock enabled */
  CLOCK_EnableClock(kCLOCK_PortB);                           /* Port B Clock Gate Control: Clock enabled */
  CLOCK_EnableClock(kCLOCK_PortC);                           /* Port C Clock Gate Control: Clock enabled */

  PORT_SetPinMux(PORTA, PIN10_IDX, kPORT_MuxAlt6);           /* PORTA10 (pin 62) is configured as FTM2_QD_PHA */
  PORT_SetPinMux(PORTA, PIN11_IDX, kPORT_MuxAlt6);           /* PORTA11 (pin 63) is configured as FTM2_QD_PHB */
  PORT_SetPinMux(PORTA, PIN12_IDX, kPORT_MuxAlt7);           /* PORTA12 (pin 64) is configured as FTM1_QD_PHA */
  PORT_SetPinMux(PORTA, PIN13_IDX, kPORT_MuxAlt7);           /* PORTA13 (pin 65) is configured as FTM1_QD_PHB */
  PORT_SetPinMux(PORTB, PIN18_IDX, kPORT_MuxAlt4);           /* PORTB18 (pin 97) is configured as FTM3_CH2 */
  PORT_SetPinMux(PORTC, PIN1_IDX, kPORT_MuxAlt4);            /* PORTC1 (pin 104) is configured as FTM0_CH0 */
  PORT_SetPinMux(PORTC, PIN2_IDX, kPORT_MuxAlt4);            /* PORTC2 (pin 105) is configured as FTM0_CH1 */
  PORT_SetPinMux(PORTC, PIN3_IDX, kPORT_MuxAlt4);            /* PORTC3 (pin 106) is configured as FTM0_CH2 */
  PORT_SetPinMux(PORTC, PIN4_IDX, kPORT_MuxAlt4);            /* PORTC4 (pin 109) is configured as FTM0_CH3 */
  PORT_SetPinMux(PORTC, PIN8_IDX, kPORT_PinDisabledOrAnalog); /* PORTC8 (pin 113) is configured as HSADC1B_CH11 */
  PORT_SetPinMux(PORTC, PIN9_IDX, kPORT_PinDisabledOrAnalog); /* PORTC9 (pin 114) is configured as HSADC1B_CH12 */
  SIM->SOPT8 = ((SIM->SOPT8 &
    (~(SIM_SOPT8_FTM0OCH0SRC_MASK | SIM_SOPT8_FTM0OCH1SRC_MASK | SIM_SOPT8_FTM0OCH2SRC_MASK | SIM_SOPT8_FTM0OCH3SRC_MASK | SIM_SOPT8_FTM3OCH2SRC_MASK))) /* Mask bits to zero which are setting */
      | SIM_SOPT8_FTM0OCH0SRC(SOPT8_FTM0OCH0SRC_FTM)         /* FTM0 channel 0 output source: FTM0_CH0 pin is output of FTM0 channel 0 output */
      | SIM_SOPT8_FTM0OCH1SRC(SOPT8_FTM0OCH1SRC_FTM)         /* FTM0 channel 1 output source: FTM0_CH1 pin is output of FTM0 channel 1 output */
      | SIM_SOPT8_FTM0OCH2SRC(SOPT8_FTM0OCH2SRC_FTM)         /* FTM0 channel 2 output source: FTM0_CH2 pin is output of FTM0 channel 2 output */
      | SIM_SOPT8_FTM0OCH3SRC(SOPT8_FTM0OCH3SRC_FTM)         /* FTM0 channel 3 output source: FTM0_CH3 pin is output of FTM0 channel 3 output */
      | SIM_SOPT8_FTM3OCH2SRC(SOPT8_FTM3OCH2SRC_FTM)         /* FTM3 channel 2 output source: FTM3_CH2 pin is output of FTM3 channel 2 output */
    );
}



#define PIN4_IDX                         4u   /*!< Pin number for pin 4 in a port */

#define PIN5_IDX                         5u   /*!< Pin number for pin 5 in a port */

#define PIN6_IDX                         6u   /*!< Pin number for pin 6 in a port */

#define PIN11_IDX                       11u   /*!< Pin number for pin 11 in a port */
#define PIN21_IDX                       21u   /*!< Pin number for pin 21 in a port */

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
InductancePinsInit:
- options: {callFromInitBoot: 'true', prefix: INDUCTANCEPINSINIT_, coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '7', peripheral: HSADC1, signal: 'ADCA, CH4', pin_signal: HSADC1A_CH4/ADC0_SE2/ADC0_DP2/PTE4/LLWU_P2/SPI1_PCS0/UART3_TX/TRACE_D0}
  - {pin_num: '8', peripheral: HSADC1, signal: 'ADCA, CH5', pin_signal: HSADC1A_CH5/ADC0_SE10/ADC0_DM2/PTE5/SPI1_PCS2/UART3_RX/FLEXPWM1_A0/FTM3_CH0}
  - {pin_num: '14', peripheral: HSADC1, signal: 'ADCA, CH6', pin_signal: HSADC1A_CH6/ADC0_SE3/ADC0_DP3/PTE11/UART5_RTS_b/FLEXPWM1_A3/FTM3_CH6}
  - {pin_num: '26', peripheral: HSADC1, signal: 'ADCA, CH7', pin_signal: HSADC0A_CH9/HSADC1A_CH7/PTE21/XB_IN9/FTM1_CH1/UART0_RX/FTM1_QD_PHB}
  - {pin_num: '132', peripheral: HSADC1, signal: 'ADCA, CH8', pin_signal: HSADC1A_CH8/PTD5/SPI0_PCS2/UART0_CTS_b/UART0_COL_b/FTM0_CH5/FLEXPWM0_B2/EWM_OUT_b/SPI1_SCK/FB_AD1}
  - {pin_num: '133', peripheral: HSADC1, signal: 'ADCA, CH9', pin_signal: HSADC1A_CH9/PTD6/LLWU_P15/SPI0_PCS3/UART0_RX/FTM0_CH6/FTM1_CH0/FTM0_FLT0/SPI1_SOUT/FB_AD0}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/*FUNCTION**********************************************************************
 *
 * Function Name : InductancePinsInit
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 *END**************************************************************************/
void InductancePinsInit(void) {
  CLOCK_EnableClock(kCLOCK_PortD);                           /* Port D Clock Gate Control: Clock enabled */
  CLOCK_EnableClock(kCLOCK_PortE);                           /* Port E Clock Gate Control: Clock enabled */

